Repository: Appadeia/barista
Catalog: messages/barista_tpo.po
Languages: tpo_tpo

source: Previous
tpo_tpo: tawa pini

source: Next
tpo_tpo: tawa kama

source: Red Hat Bugzilla
tpo_tpo: ilo Pasila Red Hat

source: SUSE Bugzilla
tpo_tpo: ilo Pasila SUSE

source: openSUSE Bugzilla
tpo_tpo: ilo Pasila openSUSE

source: Novell Bugzilla
tpo_tpo: ilo Pasila Novell

source: GNOME Bugzilla
tpo_tpo: ilo Pasila GNOME

source: Kernel Bugzilla
tpo_tpo: ilo Pasila Kernel

source: Mozilla Bugzilla
tpo_tpo: ilo Pasila Mozilla

source: Samba Bugzilla
tpo_tpo: ilo Pasila Samba

source: Xfce Bugzilla
tpo_tpo: ilo Pasila Xfce

source: KDE Bugzilla
tpo_tpo: ilo Pasila KDE

source: Freedesktop Bugzilla
tpo_tpo: ilo Pasila Freedesktop

source: GCC Bugzilla
tpo_tpo: ilo Pasila GCC

source: Mageia Bugzilla
tpo_tpo: ilo Pasila Mageia

source: Bugzilla
tpo_tpo: ilo Pasila

source: Tag bugs on various Bugzilla instances
tpo_tpo: lukin e ijo ike lon ilo Pasila

source: Product
tpo_tpo: ilo

source: Version
tpo_tpo: nanpa

source: Component
tpo_tpo: insa ilo

source: Priority
tpo_tpo: suli ala suli

source: Severity
tpo_tpo: ike ala ike

source: Status
tpo_tpo: lon

source: Bodhi Updates
tpo_tpo: ijo sin pi ilo Posi

source: Link to Bodhi updates
tpo_tpo: lukin e ijo sin pi ilo Posi

source: Fedora Bodhi Updates
tpo_tpo: nanpa pi ijo sin pi ilo Posi pi kulupu ilo Pepola

source: Fedora Updates System
tpo_tpo: nasin pi ijo sin pi kulupu ilo Pepola

source: Distro
tpo_tpo: ilo

source: Karma
tpo_tpo: mani pona

source: Builds
tpo_tpo: ijo

source: GSettings
tpo_tpo: wile sina

source: Configure the bot
tpo_tpo: toki e ni: wile sina tawa ilo ni

source: Preferred Locale
tpo_tpo: toki sina

source: The preferred language of this channel.
tpo_tpo: sina wile toki kepeken seme?

source: Default Distro
tpo_tpo: ilo Linu nanpa wan

source: The default distro to use for package searches.
tpo_tpo: sina toki ala e ilo Linu seme la mi lukin e ni

source: Setting reset!
tpo_tpo: wile sina li lon ala!

source: Setting updated!
tpo_tpo: mi sona e wile sona!

source: %s is not an accepted value. Please use a value from the following list: %s
tpo_tpo: %s li ike mute! o kepeken e ijo tan ni: %s

source: %s is not a valid setting key
tpo_tpo: %s li lon ala

source: Command
tpo_tpo: ilo

source: Pagure
tpo_tpo: ilo Paku

source: Link to Pagure issues or pull requests
tpo_tpo: lukin e jaki anu pali lon ilo Paku

source: Pull Request
tpo_tpo: wile pali

source: Merge [%s/%s](%s) into [%s](%s)
tpo_tpo: o pana e [%s/%s](%s) tawa [%s](%s)

source: Issue #%s: %s - %s
tpo_tpo: ijo ike nanpa %s: %s - %s

source: DNF Repository Query
tpo_tpo: alasa pi ilo DNF

source: Query repositories with DNF
tpo_tpo: o lukin e kulupu ilo kepeken ilo DNF

source: Which distro you want to query repos for
tpo_tpo: kulupu pi wile lukin sina

source: Please provide a distro from the following list: %s
tpo_tpo: o pana e kulupu ilo lon ni tawa mi: %s

source: There was an issue connecting to QueryKit, the package search service.
tpo_tpo: ilo QueryKit li pakala a! o toki e jan Pontajosi.

source: Please provide a query with your flag.
tpo_tpo: o pana e wile sina tawa mi.

source: There was an issue searching for packages: %s
tpo_tpo: ni li pakala: %s

source: No packages were found.
tpo_tpo: mi kama ala e ilo.

source: There was an error querying packages: %s
tpo_tpo: ni li pakala: %s

source: Query %s for %s
tpo_tpo: lukin e %s tawa %s

source: %s Repoquery
tpo_tpo: lukin pi ilo %s

source: Page
tpo_tpo: lipu

source: There was an error listing files: %s
tpo_tpo: ni li pakala: %s

source: Please provide a query.
tpo_tpo: o pana e wile sina tawa mi.

source: Word
tpo_tpo: nimi

source: Please provide a word from pu to look up the etymolygy of.
tpo_tpo: mi wile e ni: nimi

source: Sorry, I don't think that's a word.
tpo_tpo: nimi ona li lon ala.

source: Please provide a word from pu to look up the meaning of.
tpo_tpo: mi wile e ni: nimi

source: Aliases
tpo_tpo: toki ante

source: Examples
tpo_tpo: ijo sama ni

source: Flags
tpo_tpo: wile lili sina

source: Tags
tpo_tpo: ilo lili

source: Tag
tpo_tpo: ilo lili

source: %s Package Search
tpo_tpo: lukin lon kulupu ilo %s

source: Download Size
tpo_tpo: suli linluwi

source: Install Size
tpo_tpo: suli lon

source: Package
tpo_tpo: poki ilo

source: Search results for %s in %s
tpo_tpo: mi kama e ni tawa %s lon %s

source: %d packages found
tpo_tpo: mi kama e poki ilo %d

source: Name
tpo_tpo: nimi

source: Description
tpo_tpo: sona

source: DNF Package Search
tpo_tpo: lukin pi ilo DNF

source: Search packages with DNF
tpo_tpo: lukin tawa poki ilo kepeken ilo DNF

source: Which distro you want to use.
tpo_tpo: kulupu pi wile lukin sina

source: Please provide a distro with the flag `--distro`.
tpo_tpo: o pana e wile sina tawa mi kepeken `--distro`.

source: Please provide a search term.
tpo_tpo: o pana e wile sina tawa mi

source: There was an issue searching for packages:
tpo_tpo: ni li pakala:

source: %s %d out of %d
tpo_tpo: %s %d / %d

source: Programming
tpo_tpo: pali ilo

source: Program in a language.
tpo_tpo: o pali e ilo kepeken toki ilo

source: There was an error accessing the API: %s
tpo_tpo: ni li pakala: %s

source: There was an error accessing data from the API: %s
tpo_tpo: ni li pakala: %s

source: Program Results
tpo_tpo: toki pi ilo sina

source: Output
tpo_tpo: toki

source: Warnings
tpo_tpo: toki nasa

source: Errors
tpo_tpo: toki ike

source: Your program produced no output.
tpo_tpo: ilo sina li toki ala.

source: %s is not a valid programming language. Use go build list to see a list of programming languages.
tpo_tpo: %s li toki ilo ala. sina wile e lukin e toki ilo mi la o go build list

source: Merge %s into %s
tpo_tpo: o pana e %s tawa %s

source: Starting quiz... Type '%s' to cancel
tpo_tpo: mi pana e lipu sona tawa sina. sina wile pini e ni la o '%s'.

source: cancel
tpo_tpo: opini

source: What does this word mean?
tpo_tpo: ni li seme lon toki Inli?

source: Quiz cancelled.
tpo_tpo: mi pini.

source: Quiz Results
tpo_tpo: pali sina

source: Correct Results
tpo_tpo: pali pona

source: Incorrect Results
tpo_tpo: pali ike

source: this is very simple. very, very simple. takes a lot of digits to write stuff.
tpo_tpo: ni li pona. pona mute mute. ni li wile e lipu mute.

source: some math says this is the most economic base out there? dunno what that means.
tpo_tpo: nasin nanpa li toki e ni: ni li pona mute mute mute. taso mi sona ala e ona.

source: better binary, i guess.
tpo_tpo: nasin nanpa tu. taso ona li pona mute.

source: base five, for five-fingered creatures.
tpo_tpo: nanpa luka. ni li tawa soweli pi jo luka.

source: this is the favourite of the guy who became a meme for a rant on rjienrlwey.
tpo_tpo: ni li pona mute tawa jan Misali.

source: wow, you look like you're into weird numbers.
tpo_tpo: nanpa nasa li pona tawa sina.

source: octal, the base that people only know because of UNIX. my favourite, though.
tpo_tpo: nasin nanpa luka tu wan. nasin nanpa pi ilo UNIX. taso ni li pona mute tawa mi.

source: weirdly fine.
tpo_tpo: ni li nasa. taso ni li pona.

source: well uh, it's decimal. booring.
tpo_tpo: ni li nasa ala.

source: not decimal.
tpo_tpo: ni li nasin nanpa luka luka ala.

source: apparently people really like this.
tpo_tpo: ni li pona tawa jan mute.

source: only takes one digit to represent a baker's dozen of bread.
tpo_tpo: ni li wile e sitelen lili wan tawa nanpa luka luka tuli.

source: how do you even get to these bases?!
tpo_tpo: sina lon ni tan seme?!?

source: great base if you have a third hand. does anyone have a third hand?
tpo_tpo: sina jo e luka tuli la ni li pona tawa sina. jan pi jo e luka tuli li lon ala lon?

source: what is this bases's job? being less ugly binary.
tpo_tpo: ni li pali e seme? nasin nanpa tu. taso lukin ike ala.

source: the suboptimal base for suboptimal people.
tpo_tpo: ni li ike mute.

source: i'm pretty thirsy
tpo_tpo: mi wile e telo.

source: base 19, the 19th base!
tpo_tpo: nasin nanpa 19!

source: a decent base for decent people.
tpo_tpo: ni li pona lili.

source: only takes a single digit to write a day!
tpo_tpo: ni li nasin nanpa tenpo.

source: 6 * 6 gets you this?
tpo_tpo: ni li 6 * 6.

source: the lojban word for 42 is vore.
tpo_tpo: nimi Losupan tawa ni li 'vore'

source: 1/3 gross, 100% inefficient
tpo_tpo: 1/3 jaki, 100% ike.

source: the seconds are ticking
tpo_tpo: tenpo li tawa.

source: jajajaja sex number kkk kekeke
tpo_tpo: a a a a a a a ni li nanpa unpa OwO

source: quite a gross base.
tpo_tpo: ni li jaki

source: if you need to write all possible integer degrees with only one number...
tpo_tpo: sina wile e sitelen kepeken sitelen lili la...

source: smonk weed everyday
tpo_tpo: ni li nasin nanpa pi kasi nasa

source: l33t speak is annoying ngl
tpo_tpo: t0k1 p0n4

source: a superior highly composite numbers
tpo_tpo: ni li pona mute

source: plato time
tpo_tpo: nasin nanpa pi jan Pato

source: well, you could have gone over 9000...
tpo_tpo: tenpo pini la sina ken tawa 9001...

source: you went over 9000!
tpo_tpo: sina tawa 9001 a!

source: plato, you're drunk.
tpo_tpo: jan Pato o sina nasa.

source: you should learn how to say no.
tpo_tpo: mi wile e ni: sina li ken toki e "ala"

source: welcome to the baseinator, the tool that will help you figure out the best base for your needs!
tpo_tpo: o kama pona tawa ilo pi nasin nanpa. ni li pana e nasin nanpa pona tawa sina tawa sina.

source: before we begin, let's set some boundaries. what is the largest base you'd be fine with using?
tpo_tpo: nasin nanpa ni li suli tawa sina: seme?

source: give me a better base
tpo_tpo: o pana e nasin nanpa pona tawa mi

source: mmm, sorry, but you were too slow. see you next time!
tpo_tpo: sina toki ala! mi tawa.

source: that's not a number, you bonk
tpo_tpo: jan nasa o ona li nanpa ala

source: i mean, it's nice that you want to use bases that large, but seriously. do you really want to use that many digits?
tpo_tpo: wile sina li nasa.

source: i said largest
tpo_tpo: mi toki e ni: SULI.

source: now, let's see what the smallest base for you would be
tpo_tpo: nasin nanpa ni li lili tawa sina: seme?

source: got a better base than that?
tpo_tpo: sina jo ala jo e nasin nanpa pona?

source: ain't a number, twat
tpo_tpo: jan nasa o ona li nanpa ala

source: y tho
tpo_tpo: tan seme a!?!

source: i said smallest, mate
tpo_tpo: mi toki e ni: LILI.

source: really? i guess it's good that you like that base, but seriously. pick a smaller base than your maximum.
tpo_tpo: tan seme? o pana e nasin nanpa lili tawa mi. o pana ala e nasin nanpa suli tawa mi.

source: how do you even use a base that small
tpo_tpo: sina ken kepeken e nasin nanpa lili tan seme?

source: %d bases in your pool represent 1/%d with a repeating decimal
tpo_tpo: nasin nanpa %d li toki mute e 1/%d

source: %d bases in your pool represent 1/%d with %d digit(s)
tpo_tpo: nasin nanpa %d li toki e 1/%d kepeken sitelen lili %d

source: there are %d bases in your pool. the smallest base in your pool is base %d, %s. %s. do you want to remove these? (Y/n)
tpo_tpo: sina jo e nasin nanpa %d. nasin nanpa lili li ni: %d (%s). %s. sina wile ala wile e weka e ni?

source: i guess you do, then. next base!
tpo_tpo: mi weka e ona. nasin nanpa kama a!

source: aight, removed that. next base!
tpo_tpo: mi weka e ona. nasin nanpa kama a!

source: ok then, next base!
tpo_tpo: mi weka ala e ona. nasin nanpa kama a!

source: oh my, looks like base %d, %s, is the best base for your needs!
tpo_tpo: nasin nanpa %d (%s) li pona tawa sina!

source: unfortunately no bases meet your needs. what a shame!
tpo_tpo: nasin nanpa ala li pona tawa sina. ike a!

source: Notes
tpo_tpo: sona

source: Store and recall notes.
tpo_tpo: pana en lanpan e sona.

source: Coin Toss
tpo_tpo: weka mani

source: Flip a coin.
tpo_tpo: weka e mani lili.

source: You got some head!
tpo_tpo: sina kama e lawa!

source: You got Tails The Fox!
tpo_tpo: sina kama e anpa!

source: there are %d bases in your pool. the smallest base in your pool is base %d, %s. %s. do you want to remove these? (Y/n/p to peek at digits)
tpo_tpo: sina jo e nasin nanpa %d. nasin nanpa lili li %d (%s). %s. sina wile ala wile e weka e ni? (Y: wile/n: ala/p: lukin e nasin nanpa)

source: the smallest base in your pool writes 1/%d as %s. the next few smallest bases in your pool write it like this: %s
tpo_tpo: nasin nanpa lili li sitelen e 1/%d kepeken '%s'. nasin nanpa ni li sitelen e ona kepeken ni: %s

source: base %d (%s): %s
tpo_tpo: nasin nanpa %d (%s): %s
